src/cf/InformationRegisters/ДокументыЭДОКСозданиюВДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыЭДОКСозданиюВДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоматическоеСоздание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументЭДО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПравилаУчетаВидовЭДДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПравилаУчетаВидовЭДДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РольФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТематикаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяИзвещениеОПолучении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяОтветнаяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УдалитьВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыПроизвольныхДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УдалитьОчередьПриемаСообщенийЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УдалитьОчередьПриемаСообщенийЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СообщениеЭДО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОшибкиЭДОКИсправлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЭДОКИсправлению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппироватьУведомленияПоНастройкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьСоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметОшибки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыЭДОКСозданиюВДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбработкаОбновления

Процедура ЗаполнитьДокументыЭДОКСозданиюВДОПриОбновлении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДокументовЭДОКДобавлениюПриОбновлении();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	КолвоРезультатов = РезультатыЗапроса.Количество();
	
	ВыборкаКАвтоматическомуОтражению = РезультатыЗапроса[КолвоРезультатов - 2].Выбрать();
	ВыборкаПоОшибкам = РезультатыЗапроса[КолвоРезультатов - 1].Выбрать();
	
	ДобавитьДокументыЭДОПриОбновлении(ВыборкаКАвтоматическомуОтражению, Истина);
	ДобавитьДокументыЭДОПриОбновлении(ВыборкаПоОшибкам, Ложь);
	
КонецПроцедуры

#КонецОбласти

// Добавляет входящий документ ЭДО к отражению в список к отражению в документах ДО
// 
// Параметры:
//  ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Документ ЭДО, который необходимо отразить
//                                                                в документах ДО
//  АвтоматическоеСоздание - Булево, Неопределено - Указывает, необходимо ли создавать документ автоматически.
//                                       Если заполнено, то устанавливает, значение автоматического создания
//                                       Если не заполнено, то значение берется из настроек отражения в учете
Процедура ДобавитьДокументКОтражениюВДО(ДокументЭДО, АвтоматическоеСоздание = Неопределено) Экспорт
	
	Если ТипЗнч(АвтоматическоеСоздание) = Тип("Булево") Тогда
		СоздаватьАвтоматически = АвтоматическоеСоздание;
	Иначе
		РеквизитыДокументаЭДО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЭДО,
			"Организация, Контрагент, ВидДокумента");
		
		КлючПравилУчета = РегистрыСведений.ПравилаУчетаВидовЭДДО.КлючПравилОтраженияВДО(
			РеквизитыДокументаЭДО.ВидДокумента,
			РеквизитыДокументаЭДО.Организация,
			РеквизитыДокументаЭДО.Контрагент);
		
		ПравилаУчета = РегистрыСведений.ПравилаУчетаВидовЭДДО.ПараметрыДокументаПоВидуЭДО(КлючПравилУчета);
		
		Если ПравилаУчета.СоздаватьАвтоматически = Истина Тогда
			СоздаватьАвтоматически = Истина;
		Иначе
			СоздаватьАвтоматически = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.АвтоматическоеСоздание = СоздаватьАвтоматически;
	Запись.КоличествоПопытокОбработки = 0;
	Запись.Записать();
	
КонецПроцедуры

Функция ДобавитьПопыткуАвтоматическогоСоздания(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Прочитать();
	
	Запись.КоличествоПопытокОбработки = Запись.КоличествоПопытокОбработки + 1;
	Запись.Записать();
	
	Возврат Запись.КоличествоПопытокОбработки;
	
КонецФункции

Процедура СнятьДокументСАвтоматическогоСоздания(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		Запись.АвтоматическоеСоздание = Ложь;
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет входящий документ ЭДО из списка к отражению в документах ДО
// 
// Параметры:
//  ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Документ ЭДО, который необходимо убрать из списка
Процедура УдалитьДокументИзСпискаКОтражению(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	
	Запись.Удалить();
	
КонецПроцедуры

Функция ДокументЭДОТребуетОтраженияВДО(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФукции

#Область ОбработкаОбновления

Функция ТекстЗапросаДокументовЭДОКДобавлениюПриОбновлении()
	
	Возврат
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ДокументЭДО,
		|	УдалитьОчередьПриемаСообщенийЭДО.КоличествоПопытокОбработки КАК ПопытокОбработки
		|ИЗ
		|	РегистрСведений.УдалитьОчередьПриемаСообщенийЭДО КАК УдалитьОчередьПриемаСообщенийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО УдалитьОчередьПриемаСообщенийЭДО.СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОшибкиЭДОКИсправлению.ПредметОшибки КАК ДокументЭДО,
		|	0 КАК ПопытокОбработки
		|ИЗ
		|	РегистрСведений.ОшибкиЭДОКИсправлению КАК ОшибкиЭДОКИсправлению
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО ОшибкиЭДОКИсправлению.ПредметОшибки = ЭлектронныйДокументВходящийЭДО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьОчередьПриемаСообщенийЭДО КАК УдалитьОчередьПриемаСообщенийЭДО
		|		ПО ОшибкиЭДОКИсправлению.ПредметОшибки = УдалитьОчередьПриемаСообщенийЭДО.СообщениеЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	УдалитьОчередьПриемаСообщенийЭДО.СообщениеЭДО ЕСТЬ NULL";
	
КонецФункции

Процедура ДобавитьДокументыЭДОПриОбновлении(Выборка, АвтоматическоеСоздание)
	
	Пока Выборка.Следующий() Цикл
		
		ДокументЭДО = Выборка.ДокументЭДО;
		
		ЗаписьНовая = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
		ЗаписьНовая.ДокументЭДО = ДокументЭДО;
		
		Если АвтоматическоеСоздание = Истина Тогда
			ЗаписьНовая.АвтоматическоеСоздание = Истина;
			ЗаписьНовая.КоличествоПопытокОбработки = Выборка.ПопытокОбработки;
		КонецЕсли;
		
		ЗаписьНовая.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
